0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 -1 0 0 0 0 ];

internalField   uniform 0.1;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    atmosphere
    {
        // type            zeroGradient;
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    bottle
    {
        type            omegaWallFunction;
        value           $internalField;
    }


}


// ************************************************************************* //
