0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        // type            fixedValue;
        // value           $internalField;
    }

    bottle
    {
        type            fixedFluxPressure;
        value           uniform 100000;
    }

    atmosphere
    {
        type            totalPressure;
        p0              uniform 100000;
    }

    // defaultFaces
    // {
    //     type            empty;
    // }
}


// ************************************************************************* //
