system/fieldVariables
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      volFlux;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
    //y++
    yPlusFluid
    {
        type            yPlus;
        libs            ("fieldFunctionObjects");
        writeControl    writeTime;
        writeFields     true;
    }

    //----------------------------------
    //Volume flux    
    //----------------------------------
    
    
    //----------------------------------
    //Temperature
    //----------------------------------
    

    //----------------------------------
    //Heat flux
    //----------------------------------
    

// ************************************************************************* //
