system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.water 0
);

regions
(
    // boxToCell
    // {
    //     // box (0 0.95 -1.25) (1 1.89913 -0.25);
    //     box (0 1.5 -1.25) (1 1.89913 -0.25);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.water 1
    //     );
    // }
);


// ************************************************************************* //
