system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:                                        |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}

inlet.stl    {extractionMethod extractFromSurface; includedAngle 180; subsetFeatures {nonManifoldEdges no; openEdges yes;} writeObj yes;}
atmosphere.stl    {extractionMethod extractFromSurface; includedAngle 180; subsetFeatures {nonManifoldEdges no; openEdges yes;} writeObj yes;}
bottle.stl    {extractionMethod extractFromSurface; includedAngle 180; subsetFeatures {nonManifoldEdges no; openEdges yes;} writeObj yes;}
